Reports/ПорученияДетально.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>ПорученияДетально</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/СлужебнаяЗаписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СлужебнаяЗаписка</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.АктВыполненияДоговора</xr:Item>
				<xr:Item>Document.Анкета</xr:Item>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ВыплатаЗаработнойПлаты</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.Договор</xr:Item>
				<xr:Item>Document.ДополнительноеСоглашение</xr:Item>
				<xr:Item>Document.Замер</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.ИнвентаризацияМатериалов</xr:Item>
				<xr:Item>Document.Инкассация</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.МодернизацияОС</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.НазначениеОпросов</xr:Item>
				<xr:Item>Document.НарядЗадание</xr:Item>
				<xr:Item>Document.НачислениеАмортизации</xr:Item>
				<xr:Item>Document.НачислениеЗаработнойПлаты</xr:Item>
				<xr:Item>Document.НачислениеЗаработнойПлатыДизайнерам</xr:Item>
				<xr:Item>Document.ОперативныйЗакуп</xr:Item>
				<xr:Item>Document.Операция</xr:Item>
				<xr:Item>Document.Переделка</xr:Item>
				<xr:Item>Document.ПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПеремещениеМатериалов</xr:Item>
				<xr:Item>Document.ПеремещениеОсновныхСредств</xr:Item>
				<xr:Item>Document.ПланРуководителя</xr:Item>
				<xr:Item>Document.ПоступлениеДополнительныхРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеМатериаловУслуг</xr:Item>
				<xr:Item>Document.ПриходДенежныхСредств</xr:Item>
				<xr:Item>Document.РабочийГрафикМонтажников</xr:Item>
				<xr:Item>Document.РасходДенежныхСредств</xr:Item>
				<xr:Item>Document.РеализацияГотовойПродукции</xr:Item>
				<xr:Item>Document.РеализацияМатериалов</xr:Item>
				<xr:Item>Document.Рекламация</xr:Item>
				<xr:Item>Document.СлужебнаяЗаписка</xr:Item>
				<xr:Item>Document.СписаниеМатериалов</xr:Item>
				<xr:Item>Document.СписаниеОсновныхСредств</xr:Item>
				<xr:Item>Document.СтоимостьИзделия</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ТребованиеНакладная</xr:Item>
				<xr:Item>Document.УстановкаЛимитаРезерва</xr:Item>
				<xr:Item>Document.УстановкаЦенНоменклатуры</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОшибкиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСлужебнойЗаписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСлужебнойЗаписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виновный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ПорученияДетально/Ext/ManagerModule.bsl
Функция СформироватьОтчет(ПараметрыОтчета) Экспорт 
	
	ДатаНачала = ПараметрыОтчета.Период.ДатаНачала;
	ДатаОкончания = ПараметрыОтчета.Период.ДатаОкончания;
	Сотрудник = ПараметрыОтчета.Сотрудник;
	БезЗавершенных = ПараметрыОтчета.БезЗавершенных;
	
	ВидОтчета = ПараметрыОтчета.ВидОтчета;
	МассивТипов = Новый Массив;
	Если ВидОтчета = "СлужебнаяЗаписка" Тогда
		МассивТипов.Добавить(Тип("ДокументСсылка.СлужебнаяЗаписка"));
	ИначеЕсли ВидОтчета = "Поручение" Тогда
		МассивТипов.Добавить(Тип("ДокументСсылка.Поручение"));
	Иначе
		МассивТипов.Добавить(Тип("ДокументСсылка.Поручение"));
		МассивТипов.Добавить(Тип("ДокументСсылка.СлужебнаяЗаписка"));
	КонецЕсли;
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Автомасштаб = Истина;
	
	Макет = Отчеты.ПорученияДетально.ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.Период = ПараметрыОтчета.Период;
	ОбластьЗаголовок.Параметры.Сотрудник = Сотрудник;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Поручение.СрокВыполнения КАК СрокВыполнения,
	|	Поручение.Задача КАК Текст,
	|	Поручение.Пояснение КАК Ответ,
	|	Поручение.Оценка КАК Оценка,
	|	Поручение.ДатаВыполнения КАК ДатаВыполнения,
	|	Поручение.Замечания КАК Примечание,
	|	Поручение.Документы.(
	|		Документ
	|	),
	|	Поручение.Поручения.(
	|		Поручение
	|	),
	|	Поручение.Ссылка,
	|	NULL КАК ДатаОтвета,
	|	Поручение.Автор,
	|	ВЫБОР
	|		КОГДА Поручение.Оценка <= """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Отметка
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Сотрудник = &Сотрудник
	|	И Поручение.СрокВыполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	СлужебнаяЗаписка.Проблема,
	|	СлужебнаяЗаписка.Ответ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СлужебнаяЗаписка.Документы.(
	|		Документ
	|	),
	|	СлужебнаяЗаписка.Поручения.(
	|		Поручение
	|	),
	|	СлужебнаяЗаписка.Ссылка,
	|	СлужебнаяЗаписка.ДатаОтвета,
	|	СлужебнаяЗаписка.Автор,
	|	СлужебнаяЗаписка.Завершить
	|ИЗ
	|	Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
	|ГДЕ
	|	СлужебнаяЗаписка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И СлужебнаяЗаписка.Адресат = &Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	СрокВыполнения";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	МассивСтрок = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если БезЗавершенных И Выборка.Отметка Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ДопустимыеТипы.СодержитТип(ТипЗнч(Выборка.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок.Очистить();
		ТЗДок = Выборка.Документы.Выгрузить();
		ТабДокументов = "";
		Если ТЗДок.Количество() > 0 Тогда
			Для каждого Элемент Из ТЗДок Цикл
				ТабДокументов = ТабДокументов + Строка(Элемент.Документ) + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
		ТЗПоручений = Выборка.Поручения.Выгрузить();
		ТабПоручений = "";
		Если ТЗПоручений.Количество() > 0 Тогда
			Для каждого Элемент Из ТЗПоручений Цикл
				ТабПоручений = ТабПоручений + Строка(Элемент.Поручение) + Символы.ПС;
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.СлужебнаяЗаписка") Тогда
			ОбластьТело = Макет.ПолучитьОбласть("ТелоСЗ");
		Иначе
			ОбластьТело = Макет.ПолучитьОбласть("Тело");
		КонецЕсли;
		
		ОбластьТело.Параметры.Заполнить(Выборка);
		ОбластьТело.Параметры.Документы = ТабДокументов;
		ОбластьТело.Параметры.Поручения = ТабПоручений;
		
		МассивСтрок.Добавить(ОбластьЗаголовок);
		МассивСтрок.Добавить(ОбластьТело);
		Если НЕ ТабДок.ПроверитьВывод(МассивСтрок) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДок.Вывести(ОбластьЗаголовок);
		КонецЕсли;
		ТабДок.Вывести(ОбластьТело);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
